app/controllers/admin_controller.rb

  def report
    @period = Period.find(params[:id])
    #@punches = @period.punches
    @punches = Punch.find(:all, :conditions => ["period_id = ?",@period.id], :order => "user_id,ptime")
---
SELECT * FROM "periods" WHERE ("periods"."id" = 1)
SELECT * FROM "punches" WHERE (period_id = 1) GROUP BY user_id ORDER BY user_id,ptime