app/controllers/punches_controller.rb

SELECT * FROM "users"
---
  def index
    @punches = Punch.find(:all, :limit => 5, :order => "ptime DESC")
    @users = User.all # for sidebare

SELECT * FROM "punches" WHERE ("punches"."id" = 1)
---
  def show
    @punch = Punch.find(params[:id])

SELECT * FROM "users"
---
  def new
    @punch = Punch.new
    @users = User.all # for sidebar

SELECT "punches".id FROM "punches" WHERE ("punches"."ptime" = '2010-12-31 16:16:02') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "clocked_in" = 't', "updated_at" = '2010-12-30 13:18:17' WHERE "id" = 2
SELECT "periods".id FROM "periods" WHERE ("periods"."ending" = '2011-01-24 05:00:00') LIMIT 1
INSERT INTO "periods" ("starting", "updated_at", "ending", "created_at") VALUES('2011-01-10 05:00:00', '2011-01-24 18:54:49', '2011-01-24 05:00:00', '2011-01-24 18:54:49')
INSERT INTO "punches" ("updated_at", "period_id", "ptime", "note", "ip", "user_id", "ptype", "created_at") VALUES('2010-12-30 13:57:00', 1, '2010-12-30 13:57:00', NULL, '127.0.0.1', 1, 'I', '2010-12-30 13:57:00')
---
  def create
    @punch = Punch.new(params[:punch])
    ptime = Time.now # @punch.created_at
    @punch.ptime = ptime
    user = User.find(@punch.user_id)
    if user.employed
      user.clocked_in = !user.clocked_in
      user.save
      period = Period.find(:first, :order => "ending DESC")
      if period.ending < ptime
        pending = period.ending
        period = Period.new
        period.starting = pending
        period.ending = pending.advance(:days => 14)
        period.save
      end
      @punch.period_id = period.id
    else
      flash[:notice] = "User not employed. ID: #{user.id} Name: #{user.fname}"
    end
    @punch.ptype = user.clocked_in ? 'I' : 'O'
    @punch.ip = request.remote_ip
    if @punch.save